---
detect:
  title: powerdump_pid_0002_pshell_cmd
  description:
    - dumping hashes from a Windows System
    - powershell script
    - matches on common pshell commands
  detectType: aggregate_multiline_match
  detectLanguage: kql
  detectCon: 1
  urgency: rapid
  inTheWild: common
  noiseProjection: zero
  regressionVolume: only attack pattern match
  analysisEffort: low
  confidence: certain
intel:
  tags:
    -
  attackId:
    - t1003
  references:
    - ref_powerdump.md
  emulation:
    - art_t1003002_test4_uid_804f28fc-68fc-40da-b5a2-e9d0bce5c193
  pattern:
    -
dataRequirements:
  dataSource:
    - windows_os
  dataType:
    - powershell_command
  dataCollector: m365d_agent
  dataForwardTo: m365d_security_center
  dataParser:
  dataStorage: m365d_security_center
  dataTable: device_events
  dataIndex:
  dataAccess: api_advanced_hunting
  dataMap:
logic:
  kqlVar: | 
    let PowerDumpDevice = materialize(DeviceEvents | where ActionType =~ "PowershellCommand"
    | where AdditionalFields has_any ('elevateprivs', 'userhashes', 'dumphashes', 'bootkey', 'decrypthashes')
    | distinct DeviceId);
  kqlTable: DeviceEvents
  kqlQuery: | 
    | where ActionType =~ "PowershellCommand"
      and DeviceId in (PowerDumpDevice)
    | extend Pshell = parse_json(AdditionalFields).Command
    | summarize PshellSet=make_set(Pshell), arg_max(Timestamp, *) by DeviceName, bin(Timestamp, 1h)
    | where PshellSet has_all(@'get-childitem', 'ElevatePrivs', @'get-process', @'get-userhashes', 'dumphashes', @'get-bootkey', 'decrypthashes')